<template>
  <div>
    <div class="chart" ref="chart"></div>
  </div>
</template>

<script>
  import echarts from 'echarts'
  import macarons from '../lib/macarons'

  export default {
    name: "blog-chart",
    mounted() {
      let dom = this.$refs.chart
      let option = {
        title: {
          text: '股票走势',
          subtext: '纯属虚构'
        },
        tooltip: {
          trigger: 'axis'
        },

        calculable: true,
        xAxis: [{
          type: 'category',
          boundaryGap: false,
          data:['3月1日','3月2日','3月3日','3月4日','3月5日','3月6日','3月7日','3月8日','3月9日','3月10日','3月11日','3月12日','3月13日','3月14日','3月15日','3月16日','3月17日','3月18日','3月19日','3月20日','3月21日','3月22日','3月23日','3月24日','3月25日','3月26日','3月27日','3月28日','3月29日','3月30日','4月1日','4月2日','4月3日','4月4日','4月5日','4月6日','4月7日','4月8日','4月9日','4月10日','4月11日','4月12日','4月13日','4月14日','4月15日','4月16日','4月17日','4月18日','4月19日','4月20日','4月21日','4月22日','4月23日','4月24日','4月25日','4月26日','4月27日','4月28日','4月29日','4月30日','5月1日','5月2日','5月3日','5月4日','5月5日','5月6日','5月7日','5月8日','5月9日','5月10日','5月11日','5月12日','5月13日','5月14日','5月15日','5月16日','5月17日','5月18日','5月19日','5月20日','5月21日','5月22日','5月23日','5月24日','5月25日','5月26日','5月27日','5月28日','5月29日','5月30日','6月1日','6月2日','6月3日','6月4日','6月5日','6月6日','6月7日','6月8日','6月9日','6月10日'
          ],
        }],
        yAxis: [{
          type: 'value',
          axisLabel: {
            formatter: '{value}'
          }
        }],
        series: [{
          name: '价格',
          type: 'line',
          data: [148, 3, 187, 15, 117, 65, 134, 178, 177, 177, 172, 181, 138, 140, 25, 19, 176, 194, 146, 187, 88, 29, 61, 95, 189, 54, 35, 193, 12, 117, 28, 132, 174, 49, 7, 155, 123, 172, 1, 135, 35, 38, 182, 150, 10, 176, 139, 169, 96, 179, 67, 129, 31, 199, 62, 15, 21, 27, 90, 67, 191, 121, 59, 48, 33, 49, 185, 42, 177, 151, 193, 176, 96, 174, 196, 189, 41, 78, 87, 30, 187, 48, 30, 199, 193, 23, 167, 158, 22, 4, 74, 22, 84, 146, 65, 27, 52, 60, 50, 35],

        }
        ]
      };

      // var myChart = echarts.init(dom, macarons);
      var myChart = echarts.init(dom);

      myChart.setOption(option, true);
    }
  }
</script>

<style scoped>

  .chart {
    width: 100%;
    height: 300px;
  }
</style>
